#### Terraform Format and Style `success`
#### Terraform Initialization `success`
#### Terraform Validation `success`
#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
module.authorisation-lambda.aws_apigatewayv2_api.twitter-auth-api-gateway-terraform: Refreshing state... [id=ib7xkhk7zh]
module.authorisation-lambda.aws_cloudwatch_log_group.twitter-auth-cloudwatch: Refreshing state... [id=/aws/lambda/twitter-auth-lambda]
module.authorisation-lambda.aws_dynamodb_table.twitter-auth-dynamoDB: Refreshing state... [id=twitter-auth]
module.authorisation-lambda.aws_iam_group.twitter-auth-api-gateway: Refreshing state... [id=TwitterAuthAPIGateway]
module.authorisation-lambda.aws_iam_role.iam-role-authorisation-lambda: Refreshing state... [id=iam-role-authorisation-lambda]
module.authorisation-lambda.aws_iam_policy.cloudwatch-policy: Refreshing state... [id=arn:aws:iam::388331548819:policy/twitter-authorisation-cloudwatch]
module.authorisation-lambda.aws_apigatewayv2_stage.twitter-auth-api-gateway-stage: Refreshing state... [id=$default]
module.authorisation-lambda.aws_iam_group_policy.twitter-auth-api-gateway-policy: Refreshing state... [id=TwitterAuthAPIGateway:twitter-auth-api-gateway-policy]
module.authorisation-lambda.aws_iam_policy_attachment.cloudwatch-policy-attachment: Refreshing state... [id=twitter-authorisation-cloudwatch]
module.authorisation-lambda.aws_lambda_function.twitter-authorisation-lambda: Refreshing state... [id=twitter-auth-lambda]
module.authorisation-lambda.aws_lambda_permission.api-gateway-lambda-permission: Refreshing state... [id=APIGatewayToLambda]
module.authorisation-lambda.aws_apigatewayv2_integration.twitter-auth-api-gateway-lambda-integration: Refreshing state... [id=80ju4ko]
module.authorisation-lambda.aws_apigatewayv2_route.twitter-auth-api-gateway-callback-route: Refreshing state... [id=chshgmt]
module.authorisation-lambda.aws_apigatewayv2_route.twitter-auth-api-gateway-refresh-route: Refreshing state... [id=oa31ki6]
module.authorisation-lambda.aws_apigatewayv2_route.twitter-auth-api-gateway-authorise-route: Refreshing state... [id=2ya0mhk]
module.authorisation-lambda.aws_apigatewayv2_route.twitter-auth-api-gateway-token-route: Refreshing state... [id=1gvabem]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.authorisation-lambda.aws_dynamodb_table.twitter-auth-dynamoDB will be destroyed
  # (because aws_dynamodb_table.twitter-auth-dynamoDB is not in configuration)
  - resource "aws_dynamodb_table" "twitter-auth-dynamoDB" {
      - arn            = "arn:aws:dynamodb:eu-west-2:388331548819:table/twitter-auth" -> null
      - billing_mode   = "PAY_PER_REQUEST" -> null
      - hash_key       = "id" -> null
      - id             = "twitter-auth" -> null
      - name           = "twitter-auth" -> null
      - read_capacity  = 0 -> null
      - stream_enabled = false -> null
      - tags           = {} -> null
      - tags_all       = {} -> null
      - write_capacity = 0 -> null

      - attribute {
          - name = "id" -> null
          - type = "S" -> null
        }

      - point_in_time_recovery {
          - enabled = false -> null
        }

      - ttl {
          - attribute_name = "ttl" -> null
          - enabled        = true -> null
        }
    }

  # module.dynamoDB.aws_dynamodb_table.twitter-auth-dynamoDB will be created
  + resource "aws_dynamodb_table" "twitter-auth-dynamoDB" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "id"
      + id               = (known after apply)
      + name             = "twitter-auth"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = (known after apply)

      + attribute {
          + name = "id"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = (known after apply)
        }

      + server_side_encryption {
          + enabled     = (known after apply)
          + kms_key_arn = (known after apply)
        }

      + ttl {
          + attribute_name = "ttl"
          + enabled        = true
        }
    }

  # module.dynamoDB.aws_iam_group.dynamoDB-read-write-access will be created
  + resource "aws_iam_group" "dynamoDB-read-write-access" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "twitter-dynamoDB-read-write-access"
      + path      = "/"
      + unique_id = (known after apply)
    }

  # module.dynamoDB.aws_iam_group_policy.dynamoDB-read-write-accesspolicy will be created
  + resource "aws_iam_group_policy" "dynamoDB-read-write-accesspolicy" {
      + group  = "twitter-dynamoDB-read-write-access"
      + id     = (known after apply)
      + name   = "dynamoDB-read-write-access-policy"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "dynamodb:PutItem",
                          + "dynamodb:GetItem",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:dynamodb:eu-west-2:388331548819:table/twitter*"
                      + Sid      = "AccessTwitterDynamoDB"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

Plan: 3 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @MugishaU, Action: `pull_request`*